; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	thermograph0 - mode
	image1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon11)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(supports instrument6 image1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon11)
)
(:goal (and
	(pointing satellite1 Star1)
	(pointing satellite2 Phenomenon10)
	(pointing satellite4 Planet12)
	(have_image Planet5 image1)
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 thermograph0)
	(have_image Star8 thermograph0)
	(have_image Planet9 image1)
	(have_image Phenomenon10 image1)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 image1)
	(have_image Star13 thermograph0)
	(have_image Planet14 thermograph0)
	(have_image Phenomenon15 image1)
))

)

; plan
1. (turn_to satellite2 star1 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star1)
   goals met: 0 of 14
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 14
3. (calibrate satellite2 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 0 of 14
4. (turn_to satellite2 planet14 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 planet14)
   goals met: 0 of 14
5. (take_image satellite2 planet14 instrument4 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 1 of 14
6. (turn_to satellite2 planet12 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 planet12)
   goals met: 1 of 14
7. (take_image satellite2 planet12 instrument4 image1)
   added: (have_image planet12 image1)
   goals met: 2 of 14
8. (turn_to satellite2 phenomenon6 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon6)
   goals met: 2 of 14
9. (take_image satellite2 phenomenon6 instrument4 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 3 of 14
10. (turn_to satellite2 phenomenon15 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon15)
   goals met: 3 of 14
11. (take_image satellite2 phenomenon15 instrument4 image1)
   added: (have_image phenomenon15 image1)
   goals met: 4 of 14
12. (turn_to satellite2 phenomenon11 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon11)
   goals met: 4 of 14
13. (turn_to satellite1 star1 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star1)
   goals met: 5 of 14
14. (take_image satellite2 phenomenon11 instrument4 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 6 of 14
15. (turn_to satellite2 planet5 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet5)
   goals met: 6 of 14
16. (take_image satellite2 planet5 instrument4 image1)
   added: (have_image planet5 image1)
   goals met: 7 of 14
17. (turn_to satellite2 planet7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet7)
   goals met: 7 of 14
18. (take_image satellite2 planet7 instrument4 thermograph0)
   added: (have_image planet7 thermograph0)
   goals met: 8 of 14
19. (turn_to satellite2 planet9 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet9)
   goals met: 8 of 14
20. (take_image satellite2 planet9 instrument4 image1)
   added: (have_image planet9 image1)
   goals met: 9 of 14
21. (turn_to satellite2 star13 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star13)
   goals met: 9 of 14
22. (take_image satellite2 star13 instrument4 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 10 of 14
23. (turn_to satellite2 star8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star8)
   goals met: 10 of 14
24. (take_image satellite2 star8 instrument4 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 11 of 14
25. (turn_to satellite2 phenomenon10 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon10)
   goals met: 12 of 14
26. (take_image satellite2 phenomenon10 instrument4 image1)
   added: (have_image phenomenon10 image1)
   goals met: 13 of 14
27. (turn_to satellite4 planet12 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet12)
   goals met: 14 of 14
